Tekla.Structures.Drawing.GridLine
The GridLine class contains methods related to grid lines.
A drawing grid line is always a child of a grid object.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Drawing MyDrawing = new GADrawing();
View curview = new View(MyDrawing.GetSheet(), new CoordinateSystem(), new CoordinateSystem(),
new AABB(new Point(), new Point(30000, 30000, 10000)));
DrawingObjectEnumerator allObjects = curview.GetAllObjects();
Grid curGrid = allObjects.Current as Grid;
GridLine curGridLine;
DrawingObjectEnumerator allGridLines = curGrid.GetObjects();
while(allGridLines.MoveNext()) /* Iterate through all the grid lines of the grid */
{
if(allGridLines.Current is GridLine)
{
curGridLine = allGridLines.Current as GridLine;
curGridLine.Attributes.DrawTextAtStartOfGridLine = true;
curGridLine.Attributes.DrawTextAtEndOfGridLine = true;
curGridLine.Attributes.Font.Color = DrawingColors.Red;
// The following code moves the grid labels off the grid lines by 200.
curGridLine.StartLabel.GridLabelPoint.Y = curGridLine.StartLabel.GridPoint.Y + 200;
curGridLine.EndLabel.GridLabelPoint.Y = curGridLine.EndLabel.GridPoint.Y + 200;
curGridLine.Modify(); /* Apply changes */
}
}
}
}

Tekla.Structures.Drawing.GridLine.Attributes
The attributes of the grid line.
For more information see Tekla.Structures.Drawing.GridLine.GridLineAttributes.

Tekla.Structures.Drawing.GridLine.StartLabel
The beginning of the grid line, contains the grid label and position information.
For more information see Tekla.Structures.Drawing.GridLine.GridLabel.

Tekla.Structures.Drawing.GridLine.EndLabel
The end of the grid line, contains the grid label and position information.
For more information see Tekla.Structures.Drawing.GridLine.GridLabel.

Tekla.Structures.Drawing.GridLine.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.GridLine.Insert
GridLines cannot be inserted.
Returns: True on success.

Tekla.Structures.Drawing.GridLine.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.GridLine.Select
Calls the system to select and retrieve the object.
Returns: True on success.

Tekla.Structures.Drawing.GridLine.Delete
GridLines cannot be deleted.
Returns: False.